[
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Visualization Makeover on Merchandise Trade Data (2019-2020) of Singapore in Tableau",
    "author": [
      {
        "name": "LI Zhen",
        "url": "https://www.linkedin.com/in/zhen-li-8135b5189/"
      }
    ],
    "date": "2021-05-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. The original visualization\r\n2. Critiques on Clarity and Aesthetics\r\n3. Proposed Design\r\n3.1 Sektch\r\n3.2 Advantage of proposed design\r\n\r\n4. Data Visualization Process\r\n4.1 Data Preparation\r\n4.2 Data Visualization\r\n\r\n5. Final Visualization\r\n5.1 Snapshot of Final Chart\r\n5.2 Main Observations\r\n\r\n\r\n1. The original visualization\r\n The original visualization is based on the data of Department of Statistics, Singapore (DOS) and trying to reflect the import and export of merchandise trading of top six trading countries between 2019 to 2020.\r\n2. Critiques on Clarity and Aesthetics\r\nFor the original charts, there are some mistakes in clarity and aesthetics aspects. The critiques and suggestions are listed as below:\r\nFor the clarity:\r\n\r\nItem\r\nCritique\r\nSuggestion\r\n1\r\nChart title not prices - The title “Merchandise Trade of Top Six Trading Countries, 2019-2020” can’t reflect the country and measurement of this chart clearly.\r\nChange the title into “Import and export trade volume of Singapore’s six trading countries”.\r\n2\r\nY axis labels are different – The labels of export and import are different and can’t reflect the difference between export and import clearly.\r\nY axis labels should keep the same which can easily for readers to recognize.\r\n3\r\nData missing – Merchandise trading data of Japan only have the data of 2020.\r\nShould keep the data available from 2019 to 2020 for every country.\r\n4\r\nMerchandise trade order – The order of the countries’ charts can’t reflect clearly which country has the largest import and export trading with Singapore.\r\nShould sort the charts to reflect the order of top six countries.\r\n5\r\nLacking money units – From this chart, we can’t find the units of merchandise trade. It will make readers to get confused.\r\nFor the Y axis title, it should contain the “($)” to reflect the units of currency.\r\n6\r\nWrong title selection for “top six” - After calculation of total trade volume, we can find that these six countries are not the top six.\r\nChange the title\r\n\r\nFor the aesthetics:\r\n\r\nItem\r\nCritique\r\nSuggestion\r\n1\r\nLack caption – There is no caption in the bottom of the chart. The readers don’t know where the data come from.\r\nIn the bottom of the chart, we should add the data source as the caption.\r\n2\r\nChart title’s font size – The chart title should be bigger to attract reader’s attention.\r\nFor the title, we should use bigger font size the color to attract audience attention.\r\n3\r\nWidth of charts are different – Charts of Malaysia and Mainland China have wider X axis compare to the other countries. Since the X axis all reflect the same period, width of charts should be same.\r\nFor the same time period of X axis, we should use the same width of each chats.\r\n4\r\nLack of annotation to describe the data trend.\r\nAdd annotation into the chart about important trend.\r\n\r\n3. Proposed Design\r\n3.1 Sektch\r\n\r\n3.2 Advantage of proposed design\r\nThe advantages of the new design are as follow:\r\nTitle shows that the chart reflects the import and export trade volume and trading country Singapore clearly.\r\nThe different and correspond color of “import” and “export” in the title can easily let readers recognize the color of line chart and know which lines represent import trade volume and export trade volume.\r\nSort countries based on the total trade volume can let readers easily to read.\r\nKeeping the Y axis same for all six countries can help readers to compare the trade data easily.\r\nSeparating the Y axis for two charts of absolute trade volume and deficit which is the difference between import trade volume and export trade volume.\r\n4. Data Visualization Process\r\n4.1 Data Preparation\r\nWe should delete the data of all countries which is not in the period of 2019 to 2020. \r\nWe select the six countries’ trading volume data and import into a new dataset. \r\nWe should select the data of top six countries forming a dataset and import the dataset into Tableau.\r\nThe data from 2019 to 2020 are spread across multiple rows. To create a flat dataset, we can use the “Pivot” function.\r\nRename the headers. We rename the headers into “Month of Period_Import” and “Import Value” for import trade volume data. \r\nChange the type of data into “Date” \r\n4.2 Data Visualization\r\nCreate line chart To create the line chart, we should first drag [Country_Export], [Measure Values] and [YEAR (Month of Period_Export] to the column and row. \r\nTo create the chart with the continuous time, we should change the [YEAR (Month of Period_Export] into the continuous format.\r\n\r\nThen the first part of chart is completed.  2. Create “Balance of Trade“ For import and export trade volume, deficit is a critical factor for evaluation. Therefore, we create a calculated field and use the function to calculate it.\r\n\r\nThe formula of “Balance of Trade” is “[Export Value] - [Import Value]”\r\nCreate area chart for deficit After calculation of deficit, we drag [SUM (Balance of Trade)] to the row for twice and set the Y axis range for positive and negative.\r\n\r\nFor the two parts of “Balance of Trade”: We will set the range of one of them is fixed to positive and the other fixed to negative: \r\nApply color Set the color according to the positive and negative data. For the positive data, we set the color to red and set the color to blue for negative data. \r\nHide the title of X axis Double click the X axis title and delete them to hide the repeat title.\r\nAdd the title Add title “Import and export trade volume of Singapore’s top six trading countries” and set the color of word “import” and “export” according to the line chart.\r\nAdd the annotation Add the annotation for Taiwan and Hong Kong. Taiwan: Import trade volume was always higher than its export Hong Kong: Export trade volume was always higher than its import\r\nAdd the caption Add the caption: The data is from the Department of Statistics, Singapore(DOS)\r\n5. Final Visualization\r\n5.1 Snapshot of Final Chart\r\n\r\n5.2 Main Observations\r\nThe surplus and deficit in the import and export trade between Singapore and China always cross and the import and export trade volume both declined significantly at the beginning of 2020. As for the Malaysia, the import trade volume and deficit both increased significantly at the beginning of 2020.\r\nThe international trade between Singapore and the United States was dominated by a deficit in 2019, and was dominated by a surplus in 2020. Generally speaking, the total deficit is greater than the total surplus.\r\nFor trading to Taiwan, the import trade volume has always been higher than export trade volume which means there is high deficit between Taiwan and Singapore. As for Hong Kong, the import trade volume has always been lower than export trade volume which means there is high trade surplus between Hong Kong and Singapore.\r\nFrom 2019 to 2020, the import and export trade volume between Singapore and China, the United States and Malaysia fluctuates greatly over time. In contrast, the import and export trade volume between Singapore and Hong Kong, Taiwan and Japan is relatively stable.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-22-dataviz-makeover-1/img/original_chart.png",
    "last_modified": "2021-05-29T19:37:28+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
