[
  {
    "path": "posts/2021-06-18-dataviz-makeover2/",
    "title": "DataViz Makeover2",
    "description": "Describe the merchandise trade performance with 10 major trading partners from 2011 to 2020.",
    "author": [
      {
        "name": "LI Zhen",
        "url": "https://www.linkedin.com/in/zhen-li-8135b5189/"
      }
    ],
    "date": "2021-06-18",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Original Visualization\r\n2. Critiques & Suggestions\r\n2.1 Clarity\r\n2.2 Aethetics\r\n\r\n3. Proposed Design\r\n3.1 Sektch\r\n3.2 Final Design\r\n3.3 Advantage of Proposed Design\r\n\r\n4. Main Observations\r\n5. Data Visualization Process\r\n5.1 Data Preparation\r\n5.2 Annual Import and Export Visualization\r\n5.3 Trading Performance in 2020 Visualization\r\n5.4 Total Trade Visualization\r\n5.5 Dashboard\r\n\r\n\r\n1. Original Visualization\r\n\r\nThe original visualization is based on the data of merchandise trade performance with major trading partners in 2020. The data source is Department of Statistics, Singapore (DOS). Apart from the chart of trading data, there are also some notes for explain of image comprehension and annotation for trading data analysis.\r\n2. Critiques & Suggestions\r\n2.1 Clarity\r\nImproper labeling and formatting for X – axis and Y – axis: Since the minimum value for both exports and imports is zero, it is unreasonable not to have zero at the origin of coordinate axis. The area when export and import values are all negative is not existing in reality. Therefore, the origin of coordinate axis should be zero.\r\n Moreover, for the label of X-axis and Y-axis, there is no unit of measurement of currency which will make readers confused about the value and amount of transaction of exports and imports. Therefore, the labels for X-axis and Y-axis should be “Export (Billion Dollars)” and “Import (Billion Dollars)”.\r\nImproper annotation: Annotation only comprised by the country names and numbers. There is also no explanation in the notes for numbers of annotation. This will make readers confused about the meanings of numbers. From the information of this image, these data might represent the total transaction values, net exports values, net imports values, exports or imports. Therefore, the note should also explain the meaning of numbers in annotation.\r\n\r\nImproper description of chart: Since the data in this chart is from 2020, it is unreasonable to describe the trend of balance of trade between Singapore and Mainland China and United States from 2009 and 2006. Therefore, the description should focus on the trend or data of 2020.\r\n\r\n2.2 Aethetics\r\nSimilar colors of two regions: Since the author chose to use different colors represent different countries, it is inappropriate to use similar colors to represent two regions. It is hard for readers to distinguish the colors that represent Thailand and EU. Therefore, it is necessary for us to change the color represents Thailand or EU.\r\n\r\nImproper settings for circles: Since there are some countries have close exports and imports, there are overlaps between countries. Moreover, the diagonal of chart is not obvious enough for readers to judge these countries to be net exporters or net importers. For the circle represents Korea, it is hard for readers to recognize whether it is the net exporter or net importer. And for the circles represent Japan, Malaysia and EU, they are also covered by the other countries’ circles or the small circles of them are near the diagonal which makes readers hard to recognize. Therefore, we can set the transparency of circles to fix this problem.\r\n\r\nImproper choice of bubble chart: Since it is hard for readers to compare the size of circles, it is a bad decision to use circles’ size to represent the transactions values. For the countries have close transaction values, it is hard for readers to recognize which are bigger trading partners with Singapore. Therefore, we can change the charts’ type.\r\n3. Proposed Design\r\n3.1 Sektch\r\n\r\n3.2 Final Design\r\nThe final design by using Tableau is as follow:\r\n\r\n3.3 Advantage of Proposed Design\r\nX-axis and Y-axis: For all the x-axis and y-axis in the dashboard, we make sure all the data have “B” as the unit of measurement for the trading value of imports and exports. Moreover, we set 0 as the origin of coordinate axis of “Trading with major trading partners, 2020”. To make the trend of balance of trade to be more obvious, we set the Y-axis of “Annual import and export values with partner, 2011-2020” not include the 0 value.\r\nBetter annotations: For the unclear annotations of original design, we delete all the annotations for different countries and create the annotations for countries who are largest net importer, largest net exporter and largest total trading value. In this way, readers can better focus themselves on the important parts and not distracted by too many annotations and colors.\r\nSimple but powerful colors: For the complicated and too many colors in the original design, we change them into three major colors for the whole dashboard. Orange represent the import and deficit. Blue represent the export and surplus. Green represent the total trading value. By doing this, readers can easily understand the information from charts and don’t need to recognize each country from many different colors by looking at the legend.\r\nInteractive design: In the final design, we use the filters and animations to make the dashboard more interactive. By these filters, readers can choose the country to see the trend of imports, exports and balance of trade values. Also, by using animations, readers can observe the changing in the ranking of these 10 major partners in terms of total trade values with Singapore from 2011 to 2020.\r\n4. Main Observations\r\n\r\nMainland China: Since 2013, Mainland China has been the largest trading partners with Singapore. From 2011 to 2020, Singapore’s annual export trade value with China is always greater than its annual import trade value. The trade balance between China and Singapore reached its largest in 2015, but both the import and export trade volume and the trade balance fell sharply in 2016. The same situation also appeared in 2017 and 2018. The export trade volume reached its highest point in 2017, but the import and export volume fell sharply in 2018. Of the two sharp declines, the export value was the most affected. The import trade volume will see a significant decline in 2020 due to the impact of the new crown epidemic.\r\n\r\nUnited States: From 2011 to 2020, the United States has played an increasingly important role in the pattern of Singapore’s foreign trade. The ranking has risen from fifth in 2011 to third in 2020 and there has been no decline in the ranking during this decade. Between 2011 and 2020, Singapore’s export trade volume to the United States has risen sharply twice in 2018 and 2020. The import trade volume has experienced two sharp declines in both 2016 and 2020. And there will be a trade surplus for the first time in 2020. This is probably due to covid-19. The balance of trade between United States and Singapore is always large from 2011 to 2019.\r\n\r\nMalaysia: Malaysia has been Singapore’s largest trading partner in 2011 and 2012, but was overtaken by China in 2013 and remained Singapore’s second largest trading partner until 2020. In 2014, the volume of export trade experienced a substantial decline and showed a declining trend until 2016. Since 2017, the volume of import and export trade began to rebound and maintained an upward trend until 2019. From 2019 to 2020, the export trade volume has dropped significantly, the import trade volume has risen slightly, and the trade deficit has appeared for the first time. The trade balance between Malaysia and Singapore reached its lowest in 2017. And it has a trade surplus from 2011 to 2019.\r\n\r\nIndonesia: The trade volume between Indonesia and Singapore has shown a downward trend, from the fourth place in 2011 to the eighth place in 2020, and there is no increase in the ranking during the period. However, the trade balance between Indonesia and Singapore has always been maintained at a relatively large value, and the trade surplus has been maintained from 2011 to 2020. Since 2018, the trade surplus has also been declining year by year. The most affected in trade is the export trade volume, while the import trade volume is relatively stable. From 2011 to 2016, the export trade volume continued to decline, and it started to rebound in 2017 and saw a significant increase in 2018. However, the downward trend continues in 2019 and 2020.\r\n5. Data Visualization Process\r\n5.1 Data Preparation\r\nUsing the filter function in Excel to choose to 10 major partners of imports and exports. Then combine them together.\r\n\r\nDelete the data outside of 2011-2020. Because the unit measurement of different countries are different, we need to use the formula to calculate the new trading values to prepare the data for Tableau.\r\n\r\nUsing Excel to calculate the annual imports and exports. Then create a new sheet for them.\r\n\r\nImport the data into Tableau.\r\n\r\nSplit the variables to get the partners name without brackets.\r\n\r\nUsing Pivot function to convert data from rows into columns.\r\n\r\nChange the data type of time and rename the columns.\r\n\r\nConnect the annual data and original data together by variables.\r\n\r\nRepeat the same steps of split, pivot, changing data types and rename for the original data.\r\n5.2 Annual Import and Export Visualization\r\nTo build this chart, we should first create a new calculating field for the lower value of imports and exports.\r\n\r\nWe need to drag year to the columns and drag trade value annual and lower trade value to the rows. To make the time continued, we need to choose the year below.\r\n\r\nDrag lower trade value to the Y-axis of sum(trade value annual) and choose “Area” as the chart type. Then drag sum(trade value annual) to the second axis and choose the “Line” as the chart type.\r\n\r\nSet the color of “export, Lower trade value” and “import, Lower trade value” to be white. Change the “Opacity” of color to 100%.\r\n\r\nFor the second Y-axis, we should right click it and choose “Synchronize Axis” and “Show Header” to hide it.\r\n\r\nSet the title:\r\n\r\nThe chart is finished!\r\n\r\n5.3 Trading Performance in 2020 Visualization\r\nBecause this chart is mainly focus on the data of 2020, we should first set the filter for time.\r\n\r\nCreate the new calculation field for export,import and balance of trade values in 2020.\r\n\r\n\r\n\r\nDrag the export to the columns and import to the rows. Then choose the circle to be the chart type.\r\nTo get the diagonal line, we should first create a new calculation field.\r\n\r\nTo add in the diagonal line, we need to drag “reference line” to the second axis of this chart.\r\n\r\nTo make the reference line extend, we choose “Show Trend Lines” to make it more extendable. Then we choose the “Synchronize Axis” to make the Y-axis range same.\r\n\r\nSet the opacity of reference line to 0%.\r\n\r\nSet the range of X-axis and Y-axis to be the same.\r\n\r\nTo improve the interactive part, we create the new calculation field of deficit and surplus.\r\n\r\nDrag the deficit and surplus into the Tooltip and edit them like following:\r\n\r\nTo change the unit measurement of the numbers, we right click the circle and choose “Format”. From the “Fields”, we choose the variables that we want to edit.\r\n\r\nChoose the format of numbers\r\n\r\nSet the title: \"Trading with major trading partners, 2020 The average import value of 2020 is 3.74B dollars, average export value of 2020 is 5.49B dollars.\r\nSet the annotation for the largest net importer, largest net exporter and largest trading partner.\r\nThe chart is finished!\r\n\r\n5.4 Total Trade Visualization\r\nSet the rank to arrange the total trade value descendingly.\r\n\r\nDrag the sum(Trade value annual) to the columns and rank to the rows.\r\n\r\nFor rank, choose the “Discrete” and “Partners” for “Computing Using”.\r\n\r\nTo polish the chart, we should drag the sum(Trade value annual) to the color. For tooltip and label, it should be look like the image below:\r\n\r\nSet the title: “Total trade values with major partners -  Mainland China and Malaysia are always the top 2 partners with SG from 2011 to 2020. However, the trading values with Indonesia are kept decreasing.”\r\nTo set the animation, drag the year to the page and turn on the animation.\r\n\r\nThe chart is finished!\r\n\r\n5.5 Dashboard\r\nSet the title for dashboard: “Merchandise trade performance with 10 major trading partners”\r\nAdd the data source in the bottom of dashboard: “Data Source: Department of Statistics, Singapore(DOS), Merchandise Trade by Region / Market.(https://www.singstat.gov.sg/find-data/search-by-theme/trade-and-investment/merchandise-trade/latest-data)”\r\nArrange the location of charts properly and finish the dashboard.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-06-18-dataviz-makeover2/pic/preview.jpg",
    "last_modified": "2021-06-19T20:10:51+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Visualization Makeover on Merchandise Trade Data (2019-2020) of Singapore in Tableau",
    "author": [
      {
        "name": "LI Zhen",
        "url": "https://www.linkedin.com/in/zhen-li-8135b5189/"
      }
    ],
    "date": "2021-05-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. The original visualization\r\n2. Critiques on Clarity and Aesthetics\r\n3. Proposed Design\r\n3.1 Sektch\r\n3.2 Advantage of proposed design\r\n\r\n4. Data Visualization Process\r\n4.1 Data Preparation\r\n4.2 Data Visualization\r\n\r\n5. Final Visualization\r\n5.1 Snapshot of Final Chart\r\n5.2 Main Observations\r\n\r\n\r\n1. The original visualization\r\n The original visualization is based on the data of Department of Statistics, Singapore (DOS) and trying to reflect the import and export of merchandise trading of top six trading countries between 2019 to 2020.\r\n2. Critiques on Clarity and Aesthetics\r\nFor the original charts, there are some mistakes in clarity and aesthetics aspects. The critiques and suggestions are listed as below:\r\nFor the clarity:\r\n\r\nItem\r\nCritique\r\nSuggestion\r\n1\r\nChart title not prices - The title “Merchandise Trade of Top Six Trading Countries, 2019-2020” can’t reflect the country and measurement of this chart clearly.\r\nChange the title into “Import and export trade volume of Singapore’s six trading countries”.\r\n2\r\nY axis labels are different – The labels of export and import are different and can’t reflect the difference between export and import clearly.\r\nY axis labels should keep the same which can easily for readers to recognize.\r\n3\r\nData missing – Merchandise trading data of Japan only have the data of 2020.\r\nShould keep the data available from 2019 to 2020 for every country.\r\n4\r\nMerchandise trade order – The order of the countries’ charts can’t reflect clearly which country has the largest import and export trading with Singapore.\r\nShould sort the charts to reflect the order of top six countries.\r\n5\r\nLacking money units – From this chart, we can’t find the units of merchandise trade. It will make readers to get confused.\r\nFor the Y axis title, it should contain the “($)” to reflect the units of currency.\r\n6\r\nWrong title selection for “top six” - After calculation of total trade volume, we can find that these six countries are not the top six.\r\nChange the title\r\n\r\nFor the aesthetics:\r\n\r\nItem\r\nCritique\r\nSuggestion\r\n1\r\nLack caption – There is no caption in the bottom of the chart. The readers don’t know where the data come from.\r\nIn the bottom of the chart, we should add the data source as the caption.\r\n2\r\nChart title’s font size – The chart title should be bigger to attract reader’s attention.\r\nFor the title, we should use bigger font size the color to attract audience attention.\r\n3\r\nWidth of charts are different – Charts of Malaysia and Mainland China have wider X axis compare to the other countries. Since the X axis all reflect the same period, width of charts should be same.\r\nFor the same time period of X axis, we should use the same width of each chats.\r\n4\r\nLack of annotation to describe the data trend.\r\nAdd annotation into the chart about important trend.\r\n\r\n3. Proposed Design\r\n3.1 Sektch\r\n{width = 500}\r\n3.2 Advantage of proposed design\r\nThe advantages of the new design are as follow:\r\nTitle shows that the chart reflects the import and export trade volume and trading country Singapore clearly.\r\nThe different and correspond color of “import” and “export” in the title can easily let readers recognize the color of line chart and know which lines represent import trade volume and export trade volume.\r\nSort countries based on the total trade volume can let readers easily to read.\r\nKeeping the Y axis same for all six countries can help readers to compare the trade data easily.\r\nSeparating the Y axis for two charts of absolute trade volume and deficit which is the difference between import trade volume and export trade volume.\r\n4. Data Visualization Process\r\n4.1 Data Preparation\r\nWe should delete the data of all countries which is not in the period of 2019 to 2020. \r\nWe select the six countries’ trading volume data and import into a new dataset. \r\nWe should select the data of top six countries forming a dataset and import the dataset into Tableau.\r\nThe data from 2019 to 2020 are spread across multiple rows. To create a flat dataset, we can use the “Pivot” function.\r\nRename the headers. We rename the headers into “Month of Period_Import” and “Import Value” for import trade volume data. \r\nChange the type of data into “Date” \r\n4.2 Data Visualization\r\nCreate line chart To create the line chart, we should first drag [Country_Export], [Measure Values] and [YEAR (Month of Period_Export] to the column and row. \r\nTo create the chart with the continuous time, we should change the [YEAR (Month of Period_Export] into the continuous format. \r\nThen the first part of chart is completed.  2. Create “Balance of Trade“ For import and export trade volume, deficit is a critical factor for evaluation. Therefore, we create a calculated field and use the function to calculate it.\r\n\r\nThe formula of “Balance of Trade” is “[Export Value] - [Import Value]”\r\nCreate area chart for deficit After calculation of deficit, we drag [SUM (Balance of Trade)] to the row for twice and set the Y axis range for positive and negative.\r\n\r\nFor the two parts of “Balance of Trade”: We will set the range of one of them is fixed to positive and the other fixed to negative: \r\nApply color Set the color according to the positive and negative data. For the positive data, we set the color to red and set the color to blue for negative data. \r\nHide the title of X axis Double click the X axis title and delete them to hide the repeat title.\r\nAdd the title Add title “Import and export trade volume of Singapore’s top six trading countries” and set the color of word “import” and “export” according to the line chart.\r\nAdd the annotation Add the annotation for Taiwan and Hong Kong. Taiwan: Import trade volume was always higher than its export Hong Kong: Export trade volume was always higher than its import\r\nAdd the caption Add the caption: The data is from the Department of Statistics, Singapore(DOS)\r\n5. Final Visualization\r\n5.1 Snapshot of Final Chart\r\n\r\n5.2 Main Observations\r\nThe surplus and deficit in the import and export trade between Singapore and China always cross and the import and export trade volume both declined significantly at the beginning of 2020. As for the Malaysia, the import trade volume and deficit both increased significantly at the beginning of 2020.\r\nThe international trade between Singapore and the United States was dominated by a deficit in 2019, and was dominated by a surplus in 2020. Generally speaking, the total deficit is greater than the total surplus.\r\nFor trading to Taiwan, the import trade volume has always been higher than export trade volume which means there is high deficit between Taiwan and Singapore. As for Hong Kong, the import trade volume has always been lower than export trade volume which means there is high trade surplus between Hong Kong and Singapore.\r\nFrom 2019 to 2020, the import and export trade volume between Singapore and China, the United States and Malaysia fluctuates greatly over time. In contrast, the import and export trade volume between Singapore and Hong Kong, Taiwan and Japan is relatively stable.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-22-dataviz-makeover-1/img/original_chart.png",
    "last_modified": "2021-05-29T21:53:23+08:00",
    "input_file": {}
  }
]
